package vt

// CharSet 表示字符集指示符。
// 这可以用于为 G0 或 G1 等选择字符集。
type CharSet map[byte]string

// 字符集。
var (
	UK = CharSet{
		'$': "£", // U+00A3 英镑符号
	}
	SpecialDrawing = CharSet{
		'`': "◆", // U+25C6 黑色钻石
		'a': "▒", // U+2592 中等密度点状图案
		'b': "␉", // U+2409 水平制表符
		'c': "␌", // U+240C 表单进纸
		'd': "␍", // U+240D 回车符
		'e': "␊", // U+240A 换行符
		'f': "°", // U+00B0 度符号
		'g': "±", // U+00B1 正负号
		'h': "␤", // U+2424 换行符
		'i': "␋", // U+240B 垂直制表符
		'j': "┘", // U+2518 右下拐角
		'k': "┐", // U+2510 右上拐角
		'l': "┌", // U+250C 左上拐角
		'm': "└", // U+2514 左下拐角
		'n': "┼", // U+253C 十字交叉
		'o': "⎺", // U+23BA 下水平线
		'p': "⎻", // U+23BB 中下水平线
		'q': "─", // U+2500 水平线
		'r': "⎼", // U+23BC 中上水平线
		's': "⎽", // U+23BD 上水平线
		't': "├", // U+251C 左丁字
		'u': "┤", // U+2524 右丁字
		'v': "┴", // U+2534 下丁字
		'w': "┬", // U+252C 上丁字
		'x': "│", // U+2502 垂直线
		'y': "⩽", // U+2A7D 小于等于
		'z': "⩾", // U+2A7E 大于等于
		'{': "π", // U+03C0 圆周率
		'|': "≠", // U+2260 不等于
		'}': "£", // U+00A3 英镑符号
		'~': "·", // U+00B7 中点
	}
)
